app/controllers/api/v1/games_controller.rb

INSERT INTO `game_players` (`checks_count`, `created_at`, `game_id`, `player_id`, `updated_at`) VALUES (NULL, '2014-04-10 19:15:44', 10, 1, '2014-04-10 19:15:44')
INSERT INTO `players` (`created_at`, `name`, `updated_at`) VALUES ('2014-04-10 18:56:40', 'Schettino', '2014-04-10 18:56:40')
SELECT `players`.* FROM `players` WHERE `players`.`name` = 'Schettino' ORDER BY `players`.`id` DESC LIMIT 1
INSERT INTO `games` (`created_at`, `moves_count`, `over`, `updated_at`, `winner_id`) VALUES ('2014-04-10 20:24:20', 0, 1, '2014-04-10 20:24:20', NULL)
---
  def new
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER)}) and return unless params[:player_name]

    begin
      player = Player.where(:name => params[:player_name]).last || Player.create(:name => params[:player_name])
      game = Game.create_game

INSERT INTO `game_players` (`checks_count`, `created_at`, `game_id`, `player_id`, `updated_at`) VALUES (NULL, '2014-04-10 22:00:37', 1, 2, '2014-04-10 22:00:37')
INSERT INTO `players` (`created_at`, `name`, `updated_at`) VALUES ('2014-04-10 22:00:37', 'Schett', '2014-04-10 22:00:37')
SELECT `players`.* FROM `players` WHERE `players`.`name` = 'Schett' ORDER BY `players`.`id` DESC LIMIT 1
SELECT `games`.* FROM `games` WHERE `games`.`id` = 1 ORDER BY `games`.`id` DESC LIMIT 1
---
  def join
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER)}) and return unless params[:player_name] && params[:game_id]

    #begin
      player = Player.where(:name => params[:player_name]).last || Player.create(:name => params[:player_name])
      game = Game.where(:id => params[:game_id]).last